[
	{
		"image": "design-a-kit.png",
		"label": "World Cup: Design your own uniform",
		"repo": "https://github.com/ryanbmarx/design-a-world-cup-kit",
		"date": "Nov. 18, 2022",
		"links": [
			{
				"headline": "Design a World Cup 2022 kit",
				"link": "https://www.usatoday.com/storytelling/world-cup-jersey-design-your-own/"
			}
		],
		"description": "I designed the initial wireframes and, eventually, developed this web app, with a focus on scaffolding and UX. I worked with two other developers to incorporate the 3D modeling. Optimizing the mobile performance was a challenge, given the sheer volume of patterns/textures and other related files needed to make this a fun experience.",
		"tags": ["ui", "svelte"]
	},
	{
		"image": "decider.png",
		"label": "The decider: A polar decision matrix",
		"repo": "https://github.com/ryanbmarx/storytelling-decider/",
		"date": "October 2022",
		"description": "In the run-up to the 2022 midterm elections, we were approached by multiple newsrooms looking to help undecided voters choose their candidates. I designed and developed this application which presents a series of prompts from user-selected topics. Responses to the prompts are categorized, and \"agreement\" is calculated.",
		"links": [
			{
				"headline": "Raphael Warnock or Herschel Walker? See which candidate is your closest match ",
				"link": "https://www.savannahnow.com/storytelling/herschel-walker-raphael-warnock-georgia-senate-candidate-how-choose/"
			},
			{
				"headline": "How conservative are you?",
				"link": "https://www.usatoday.com/storytelling/find-out-how-conservative-you-really-are/"
			}
		],
		"tags": ["tool", "ui", "svelte"]
	},
	{
		"label": "Cast of Characters",
		"image": "cast.png",
		"repo": "https://github.com/ryanbmarx/storytelling-cast-of-characters/",
		"tags": ["tool", "svelte"],

		"links": [
			{
				"headline": "Meet the Teams: USA, Mexico and Canada",
				"link": "https://www.usatoday.com/storytelling/grid/world-cup-2022-mens-roster-usa-mexico-canada/"
			},
			{
				"headline": "Dozens of election-denying candidates are running for office in seven swing states. Here's what they've said or done.",
				"link": "https://www.usatoday.com/storytelling/grid/election-deniers-running-for-office-2022/"
			},
			{
				"headline": "Ohio Statehouse Corruption: Who you need to know in the federal bribery case",
				"link": "https://www.cincinnati.com/storytelling/news/ohio-corruption-project/"
			}
		],
		"description": "A developer friend-of-the-team asked us for help with the persistent need to make a \"Who's who\" dictionary of people for large investigative projects. We designed this page and built out a framework that pulls data from a Google spreadsheet and enriches it with some organizational tools and filtering/searching.\n\nWe've tracked Capitol rioters, corrupt ohio officials and colleges that cheat. It's been used to display violence databases and sports rankings and has more configurable features than anything else I've made. There are about 30 published instances."
	},
	{
		"image": "quiz.png",
		"label": "The USA TODAY News Quiz",
		"links": [
			{
				"headline": "Test your knowledge with the USA TODAY news quiz",
				"link": "https://www.usatoday.com/storytelling/weekly-news-quiz/"
			},
			{
				"headline": "Quiz: How well do you know the Sibley's building in downtown Rochester?",
				"link": "https://www.democratandchronicle.com/storytelling/sibley-building-downtown-rochester-ny-quiz/"
			}
		],
		"tags": ["tool", "svelte"],
		"description": "Sometimes the news can and should be fun. Part of our ongoing 'news play' experiments, this quiz framework has been used to create topical and evergreen quizzes for 6 different news properties, and has been published weekly  by USA TODAY for more than two years. The primary business goals of this project was to drive reader registrations (not subscriptions).\n\nThousands of quiztakers visited Gannett sign-up pages. To encourage habitual quiztaking, this frameworks supports the possibility of two different leaderboards — weekly and all-time — as well as syndication across Gannett properties."
	},

	{
		"label": "In-Depth",
		"image": "indepth.jpg",
		"links": [
			{
				"headline": "Hallowed Sound, Vol. 2: Stories of perseverance and preservation from the American South",
				"link": "https://www.tennessean.com/in-depth/entertainment/music/2021/09/23/hallowed-sound-stories-perseverance-preservation-american-south-music/5617513001/"
			},
			{
				"headline": "A look at the stadiums where teams will compete in the 2022 FIFA World Cup in Qatar",
				"link": "https://www.usatoday.com/in-depth/graphics/2022/11/18/how-many-stadiums-does-qatar-2022-have-mapping-out-world-cup/8305335001/"
			},
			{
				"headline": "Meet the Black dancer who broke the Rockettes' color barrier",
				"link": "https://www.lohud.com/in-depth/news/2022/11/17/jennifer-jones-rockette-radio-city-music-hall/69616543007/"
			}
		],
		"tags": ["tool"],
		"description": "My team at Gannett is responsible for designing, engineering and maintaining the In-Depth article framework. This collection of tools enables more than 100 web producers across the company to craft visually stunning, reader-focused multimedia presentations using the everyday CMS and our own story editor.\n\nIt's been used to create more than 7,500 (as of December 2022) articles and is the tool of choice to present the strongest, most impactful journalism Gannett has to offer.\n\nIt has generated hundreds of thousands of pageviews, a 2x increase in engaged time over standard templates and frequently leads to subscriber conversions."
	},
	{
		"label": "In-depth: Audiograms",
		"image": "audiogram.png",
		"links": [
			{
				"headline": "Opinion — Black lives matter: We must live up to Declaration of Independence’s promise",
				"link": "https://www.northjersey.com/in-depth/opinion/2020/07/02/black-lives-matter-trump-declaration-of-independence-2020/3256925001/"
			},
			{
				"headline": "'El Paso gave me the values I have': Black leaders emerge from a Hispanic majority border city.",
				"link": "https://www.elpasotimes.com/in-depth/news/2021/03/30/meet-black-leaders-emerged-el-paso-texas-hispanic-majority-city/4578132001/"
			},
			{
				"headline": "'They are not alone': Hispanic domestic abuse survivors speak out to help other victims",
				"link": "https://www.oklahoman.com/in-depth/news/2021/08/31/hispanic-domestic-abuse-survivors-speak-out-help-other-victims/7497178002/"
			}
		],
		"tags": ["tool", "svelte"],
		"description": "This component for the In-Depth toolbox was our second-pass at audio clips. I designed and developed this from scratch as an attempt to grow the poor interaction rates observed with the first version. It's bigger and bolder — more pixels on the page — and has a strong visual presence."
	},
	{
		"label": "In-depth: SMS emulator",
		"links": [
			{
				"headline": "The Girl Collector: The story of Cody Jackson and the 16 girls who were his quarry",
				"link": "https://www.cincinnati.com/in-depth/news/2018/10/21/girl-collector-cincinnati-cody-jackson/1409756002/"
			},
			{
				"headline": "He murdered three women and was hunting a fourth. These women outsmarted a serial killer",
				"link": "https://www.northjersey.com/in-depth/news/crime/2020/02/03/how-group-women-stopped-nj-serial-killer/2661900001/"
			},
			{
				"headline": "A fiery crash shattered four lives. 20 years later, their connection yields serenity.",
				"link": "https://www.desmoinesregister.com/in-depth/news/local/columnists/courtney-crowder/2019/11/26/abbie-kampman-iowa-strangers-find-peace-20-years-after-wrong-way-crash-kills-5-mother-sisters/2570864001/"
			}
		],
		"tags": ["tool", "svelte"],
		"image": "sms.png",
		"description": "This component from the In-Depth toolbox is a top-to-bottom refactor of an existing app. Originally written in Angular (with the data hard-coded into the application), I rewrote it in our preferred Svelte, and abstracted the input data so that it could be used in any project. Visually, it uses the same CSS styling variables as the broader article stylesheets, so it adapts to existing "
	},
	{
		"label": "In-depth: Sliders",
		"image": "slider.jpg",
		"links": [
			{
				"headline": "Modernizing images of long-ago Billerica",
				"link": "https://www.wickedlocal.com/in-depth/billerica-minuteman/2021/12/27/bilerica-ma-kevin-murphy-photo-restoration-colorization-historical-pictures/6416979001/"
			},
			{
				"headline": "Lane County relies on same alert tools used during Holiday Farm Fire, but when emergency strikes, residents always will have to help each other.",
				"link": "https://www.registerguard.com/in-depth/news/2021/08/26/holiday-farm-fire-emergency-warning-system-residents-help-crucial/8102205002/"
			},
			{
				"headline": "Picture this: Eye-opening images of what climate change has done and could do to our world",
				"link": "https://www.usatoday.com/in-depth/graphics/2021/07/07/climate-change-images-offer-present-and-future-views-our-world/5173622001/"
			}
		],
		"tags": ["tool", "svelte"],
		"description": "This component for In-Depth takes two images, lines them up and toggles between them. We had originally decided to let the myriad 3rd-party versions of this tool serve In-Depth, but this one provides us useful analytics."
	},
	{
		"label": "FAQs but better: The Big Page of Help",
		"image": "bpoh.png",
		"repo": "https://github.com/ryanbmarx/storytelling-big-page-of-help",
		"links": [
			{
				"headline": "Your guide to coronavirus and COVID-19",
				"link": "https://www.usatoday.com/storytelling/covid19-coronavirus-resource-guide/"
			},
			{
				"headline": "How to get help in Milwaukee",
				"link": "https://www.jsonline.com/storytelling/milwaukee-resources-guide-housing-mental-health-education-public-safety-voting-employment-recycling/"
			},
			{
				"headline": "The ultimate Palm Beach County voter guide to the November 2022 election",
				"link": "https://www.palmbeachpost.com/storytelling/palm-beach-florida-election-voters-guide-2022/"
			}
		],
		"tags": ["tool", "svelte"],
		"description": "This concept was born in the early days of the Covid-19 pandemic. Our readers had lots of questions and needed easy access to the answers. Gannett was covering the heck out of the ordeal, but organizing that content in ways satisfy these specific, informational needs was difficult. Enter the big page of help.\n\nConstructed with SEO as a top priority, these experiences are intuitive and transactional. Individual questions are grouped by topic, and each question, by design, has an answer with more information available if desired.\n\nThe concept has been adapted for civic resources, hurricane preparedness and voting."
	},
	{
		"label": "Wildfire lookup",
		"repo": "https://github.com/ryanbmarx/storytelling-wildfire-lookup",
		"image": "wildfire.png",
		"date": "July 22, 2019",
		"links": [
			{
				"headline": "Wildfire risks: Look up every Western community",
				"link": "https://www.azcentral.com/storytelling/wildfires-risks-map-california-arizona-oregon/"
			},
			{
				"headline": "Where will the West's next deadly wildfire strike? The risks are everywhere",
				"link": "https://www.azcentral.com/in-depth/news/local/arizona-wildfires/2019/07/22/wildfire-risks-more-than-500-spots-have-greater-hazard-than-paradise/1434502001/"
			}
		],
		"tags": ["tool", "ui", "svelte"],
		"description": "This collaboration with the Arizona Republic and the USA TODAY graphics team is a custom-build interface for a custom-built database of wildfire potential in the U.S. west. Each town is measured by a series of metrics calculating the probability that it could be consumed by wildfire.\n\nThe application had a standalone instance with it's own URL, but it also was embedded into a handful of articles (built using the In-Depth framework) and pre-configured to display specific towns."
	},
	{
		"label": "Covid obituaries",
		"image": "covituaries.png",
		"repo": "https://github.com/ryanbmarx/storytelling-covid-obituaries",
		"links": [
			{
				"headline": "Detroit Free Press: We will remember",
				"link": "https://www.freep.com/storytelling/coronavirus-obituaries-michigan/"
			},
			{
				"headline": "Loved and Lost: Remembering our NJ family, friends and neighbors taken by coronavirus",
				"link": "https://www.usatoday.com/storytelling/nj-coronavirus-deaths/"
			},
			{
				"headline": "Telling the stories of those who died in the Champlain Towers collapse in Surfside, Florida",
				"link": "https://www.palmbeachpost.com/storytelling/news/surfside-miami-florida-building-collapse-victims-who-died-obituaries/"
			}
		],
		"tags": ["tool", "svelte"],
		"description": "The Covid-19 pandemic claimed at least 1.1 million Americans, and at least 6.6 million worldwide. This presentation was developed in conjunction with a newsroom in New Jersey as an artful, elegant and respectful way  to display the names of people who had died in the pandemic. It was adapted for use in Detroit and south Florida  for similar purposes."
	},
	{
		"label": "Cincy neighborhoods",
		"image": "cincy.png",
		"date": "Feb. 24, 2022",
		"links": [
			{
				"headline": "A statistical tour of Cincinnati: Breaking down the neighborhoods",
				"link": "https://www.cincinnati.com/storytelling/cincinnati-neighborhoods/"
			},
			{
				"headline": "A neighborhood report on Mount Adams",
				"link": "https://www.cincinnati.com/storytelling/cincinnati-neighborhoods/neighborhoods/mount-adams/"
			},
			{
				"headline": "A neighborhood comparison: Age, population older than 18",
				"link": "https://www.cincinnati.com/storytelling/cincinnati-neighborhoods/metrics/over-age-18/"
			}
		],
		"tags": ["svelte", "data"],
		"description": "A new census brings new data, and we developed this data-explorer microsite with the journalists in Cincinatti who were intent on unpacking claims made by politicians about \"the Cincinatti Comeback.\" This site presents a mountain of the most recent demographic data in two ways: by statistic and by neighborhood.\n\nI worked with the journalists to design each of the different views and shared development duties with the entire team. It's proven to be a success as it consistently generates traffic/engagement which spikes when new investigative articles publish. "
	},
	{
		"label": "This actual site",
		"image": "portfolio.jpg",
		"repo": "https://github.com/ryanbmarx/ryanbmarx.github.io",
		"links": [
			{
				"link": "https://ryanbmarx.com"
			}
		],
		"description": "The website you are visiting right now is built with SvelteJS andand is compiled to a static HTML file. It requires no javascript to run.",
		"tags": ["svelte"]
	},
	{
		"label": "Timeline: Class warfare in Chicago",
		"image": "classwarfare.png",
		"date": "Published: July 27, 2014",
		"description": " This collarboration with a couple of the Chicago Tribune's resident historians covers the Windy City's rich history of class warfare. It's presented in a flexible timeline rig which I built for our Tarbell-based workflow and consumes data from a Google spreadsheet.",
		"repo": "https://github.com/ryanbmarx/brief-history-of-class-warfare-timeline",
		"links": [
			{
				"headline": "A street fight through history ",
				"link": "https://graphics.chicagotribune.com/news/local/history-of-class-warfare/"
			}
		],
		"tags": ["article"]
	},
	{
		"label": "Post-election: Examining Illinois after Trump election",
		"image": "elex2016.png",
		"date": "Nov 15, 2016",
		"description": " The \"blue island\" in a red midwest was a theme we tackled in several ways following Donald Trump's presidential election. These charts try to shed light on what happened by exploring the red/blue midwestern divide via several demographics.",
		"repo": "https://github.com/ryanbmarx/midwest-voting-demographics-trump",
		"links": [
			{
				"headline": "Illinois, a blue island in a red sea: Data analysis",
				"link": "https://www.chicagotribune.com/news/ct-election-midwest-voting-demographics-htmlstory.html"
			}
		],
		"tags": ["data", "impaired"]
	},
	{
		"label": "All the bands at that big music festival",
		"image": "lollapalooza.png",
		"description": "A visualization of all the bands to ever play Lollapalooza (updated for the 25th anniversary). Includes details for each band. The data was procured by scraping the Lollapalooza website and joining it with the taxonomy from Gracenote.",
		"repo": "https://github.com/ryanbmarx/lollapalooza-genres",
		"links": [
			{
				"headline": "How Lollapalooza has evolved",
				"link": "https://graphics.chicagotribune.com/entertainment/lollapalooza-history/"
			}
		],
		"tags": ["data"]
	},
	{
		"label": "Visualization & Lookup: Paying for public schools ",
		"image": "schoolfunding.png",
		"description": "An analysis of school funding data showing that school districts in richer counties shoulder a larger share of public school costs than do districts in poorer counties. This presentation includes some analytics maps and charting along with a searchable interface for the entire dataset.",
		"repo": "https://github.com/ryanbmarx/local-funding-schools-2016",
		"links": [
			{
				"headline": "Wealthier counties shoulder more of school costs: Search the database",
				"link": "https://www.chicagotribune.com/news/ct-local-school-funding-htmlstory.html"
			}
		],
		"tags": ["data"]
	},
	{
		"label": "Faces of DACA",
		"image": "daca.jpg",
		"date": "Jan. 24, 2018",
		"description": "Tribune photographer Abel Uribe spent months taking portraits and interviews or DACA recipients, aka \"dreamers.\" For a multimedia project of this scope and nuance, a simple photo gallery will not suffice. The goal here was simple and elegant, letting the people behind the various media shine.",
		"repo": "https://github.com/ryanbmarx/faces-of-daca",
		"links": [
			{
				"headline": "Caught in a 'Dream'",
				"link": "https://graphics.chicagotribune.com/faces-of-daca-dreamers/"
			}
		],
		"tags": ["article"]
	},
	{
		"label": "The Tax Divide - A 4-part series",
		"image": "propertytax.jpg",
		"date": "June 10, 2017",
		"description": "Arguably the most important story the Tribune published in 2017 was an in-depth investagation into the corruption and inequality underlying Cook County's property-tax system. I designed the story rig as well as many of the charts and interactives contained therein. The content is delivered to the app via [ArchieML](https://archieml.org/). A subsequent version of this rig was used in the [Tribune's water rates investigation](https://graphics.chicagotribune.com/news/lake-michigan-drinking-water-rates/).",
		"repo": "https://github.com/ryanbmarx/cook-county-property-tax-stories",
		"links": [
			{
				"headline": "An unfair burden: Cook County failed to value homes accurately for years. The result: a property tax system that harmed the poor and helped the rich.",
				"link": "https://apps.chicagotribune.com/news/watchdog/cook-county-property-tax-divide/assessments.html"
			}
		],
		"tags": ["article"]
	},
	{
		"label": "The problems with weedkillers and farming",
		"image": "weedkillers.png",
		"date": "Dec. 4, 2015",
		"description": "For an investigative story on the rise of weedkiller-resistant weeds, I made code-based animations (with illustrator Rick Tuma) and graphics showing how weeds learn to resist.",
		"repo": "https://github.com/ryanbmarx/superweeds",
		"links": [
			{
				"headline": "How weeds defeat weedkillers",
				"link": "https://graphics.chicagotribune.com/news/watchdog/how-weeds-resist/"
			}
		],
		"tags": ["article"]
	},
	{
		"label": "Graphic novel presentations",
		"image": "graphicnovel.jpg",
		"description": "For a Chicago Tribune investigative project on wards of the state, illustrator Rick Tuma and I worked with the Watchdog team to produce several youth-oriented stories in graphic novel format. The main investigative pieces were critical, but a bit dry. Much of the human elements were lost in the editing process, so we collected them in these graphic essays. This rig was used again for an essay commemorating the historic disaster of the SS Eastland.",
		"repo": "https://github.com/ryanbmarx/residential-treatment-centers",
		"links": [
			{
				"headline": "Harsh Treatment",
				"link": "https://graphics.chicagotribune.com/news/watchdog/rtc/graphic-essays/"
			},
			{
				"headline": "Disaster on the Eastland: 1915 catastrophe on the Chicago River claimed 844 lives",
				"link": "https://graphics.chicagotribune.com/news/local/eastland/"
			}
		],
		"tags": ["article", "tool"]
	}
]
